src/toir_cf/src/Catalogs/торо_СостоянияСотрудника/торо_СостоянияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СостоянияСотрудника</name>
  <predefined>
    <items>
      <name>Больничный</name>
      <description>Больничный</description>
    </items>
    <items>
      <name>Выходной</name>
      <description>Выходной</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>Прогул</description>
    </items>
    <items>
      <name>Явка</name>
      <description>Явка</description>
    </items>
    <items>
      <name>Отсутствие</name>
      <description>Отсутствие</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
  </predefined>
  <attributes>
    <name>Сокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_СостоянияСотрудника/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Больничный";
	Элемент.Сокращение = "Б";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Выходной";
	Элемент.Сокращение = "В";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Командировка";
	Элемент.Сокращение = "К";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Отпуск";
	Элемент.Сокращение = "ОТ";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Прогул";
	Элемент.Сокращение = "П";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Явка";
	Элемент.Сокращение = "Я";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Простой";
	Элемент.Сокращение = "ПС";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Отсутствие";
	Элемент.Сокращение = "ОС";

КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти
